---
kind: type
id: T:Autodesk.Revit.DB.WorksetKind
source: html/b1e116b1-2ca0-61c1-533d-4a06e38e335d.htm
---
# Autodesk.Revit.DB.WorksetKind

Indicates one of the standard kinds of workset (as available in the UI).

## Syntax (C#)
```csharp
public enum WorksetKind
```